Merge pull request #69 from duynhne/fe/responsive
Fe/responsive
